tests/bfs/openHFDIBRANS_kE/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          159252;
        startFace       158029;
    }
    inlet
    {
        type            patch;
        nFaces          61;
        startFace       317281;
    }
    outlet
    {
        type            patch;
        nFaces          69;
        startFace       317342;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1531;
        startFace       317411;
    }
    wallInsideLambda
    {
        type            wall;
        inGroups        1(wall);
        nFaces          785;
        startFace       318942;
    }
)

// ************************************************************************* //
