tests/bfs/openHFDIBRANS_kE/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{ 
 	 version 	 2.0; 
 	 format 	 ascii;
 	 class 		 dictionary; 
 	 object 	 blockMeshDict; 
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 	1.0;

vertices 
( 
	 ( 0.0 0.0 0.0 )	// 000
	 ( 1.01 0.0 0.0 )	// 001
	 ( 1.01 0.01091 0.0 )	// 002
	 ( 0.0 0.01091 0.0 )	// 003
	 ( 0.0 0.0 0.0013 )	// 004
	 ( 1.01 0.0 0.0013 )	// 005
	 ( 1.01 0.01091 0.0013 )	// 006
	 ( 0.0 0.01091 0.0013 )	// 007
	 ( 1.01 0.09 0.0 )	// 008
	 ( 0.0 0.09 0.0 )	// 009
	 ( 1.01 0.09 0.0013 )	// 010
	 ( 0.0 0.09 0.0013 )	// 011
	 ( 1.5 0.01091 0.0 )	// 012
	 ( 1.5 0.09 0.0 )	// 013
	 ( 1.5 0.01091 0.0013 )	// 014
	 ( 1.5 0.09 0.0013 )	// 015
	 ( 1.5 0.0 0.0 )	// 016
	 ( 1.5 0.0 0.0013 )	// 017
); 

edges 
( 
); 

blocks 
( 
	hex
		( 0  1  2  3  4  5  6  7)	lambdaZone	( 777  8  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 3  2  8  9  7  6  10  11)	( 777  61  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 2  12  13  8  6  14  15  10)	( 377  61  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 1  16  12  2  5  17  14  6)	( 377  8  1)	simpleGrading 	( 1.0  1.0  1.0)

); 

boundary 
( 
	frontAndBack
	{
		type empty;
		faces
		(
			( 0  1  2  3)
			( 4  5  6  7)
			( 3  2  8  9)
			( 7  6  10  11)
			( 2  12  13  8)
			( 6  14  15  10)
			( 1  16  12  2)
			( 5  17  14  6)
		);
	}

	inlet
	{
		type patch;
		faces
		(
			( 3  9  11  7)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			( 12  13  15  14)
			( 16  12  14  17)
		);
	}

	walls
	{
		type wall;
		faces
		(
			( 9  8  10  11)
			( 8  13  15  10)
			( 1  16  17  5)
		);
	}

	wallInsideLambda
	{
		type wall;
		faces
		(
			( 0  1  5  4)
			( 0  3  7  4)
		);
	}

); 

mergePatchPairs 
( 
); 

